rpi5-2/20240114-2019/4-lock-partitions/32768/pgbench-warmup-25-0.log
pgbench (17devel)
transaction type: <builtin: select only>
scaling factor: 25
query mode: prepared
number of clients: 32
number of threads: 32
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2804179
number of failed transactions: 0 (0.000%)
latency average = 0.685 ms
initial connection time = 34.330 ms
tps = 46738.826542 (without initial connection time)